DELETE FROM Cities;
DELETE FROM Roads;

INSERT INTO Cities VALUES
(1, 'Таратайка', 5, 5, 5),
(2, 'Карманск', 100, 5, 5),
(3, 'Бобровск', 5, 100, 5),
(4, 'Барбариск', 5, 5, 100),
(5, 'Турбонадувск', 80, 80, 5),
(6, 'Тессерактово', 80, 5, 80),
(7, 'Елыпаловск', 5, 80, 80),
(8, 'Датабейсово', 70, 70, 70),
(9, 'Сосновск', 90, 40, 40),
(10,'Агаповка', 10, 10, 10);

INSERT INTO Roads VALUES
(1, 2), 
(1, 3), 
(1, 4), 
(1, 5), 
(1, 6), 
(1, 7),
(2, 9), 
(2, 5),
(3, 5), 
(3, 7),
(4, 6), 
(4, 7),
(5, 8), 
(5, 9),
(6, 8), 
(6, 9),
(7, 8), 
(7, 9),
(8, 10),
(9, 10);